In [151]:
import pandas as pd

# Pandas Series Object

In [152]:
# Pandas Series wraps a sequence of values and indices into a 1d array of indexed data
# creating series from a list:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [153]:
# values are a numpy array
data.values

array([ 0.25,  0.5 ,  0.75,  1.  ])

In [154]:
# index is an array-like object of type pd.Index
data.index

RangeIndex(start=0, stop=4, step=1)

In [155]:
print(data[1])
print(data[1:3])

0.5
1    0.50
2    0.75
dtype: float64

In [156]:
# index doesn't need to be int, we can use strings
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [157]:
data['b']

0.5

In [158]:
# using nonsequential indices
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=[1, 3, 5, 7])
data[5]

0.75

In [159]:
# series is like a dictionary, but with typed indices and values for efficiency
population_dict = {'CA': 38332521,
                   'TX': 26448193,
                   'NY': 19651127,
                   'FL': 19552860,
                   'IL': 12882135}
population = pd.Series(population_dict)
population

CA    38332521
FL    19552860
IL    12882135
NY    19651127
TX    26448193
dtype: int64

In [160]:
population['CA']

38332521

In [161]:
# unlike dict, Series supports array-style operations like slicing
population['CA':'IL']

CA    38332521
FL    19552860
IL    12882135
dtype: int64

In [162]:
# constructing Series objects

In [163]:
# from a list or NP array, where it defaults to int
pd.Series([2, 4, 6])

0    2
1    4
2    6
dtype: int64

In [164]:
## from a scalar, which repeats to fill index
pd.Series(5, index=[100, 200, 300])

100    5
200    5
300    5
dtype: int64

In [165]:
#from a dict, where index defaults to sorted dict keys
pd.Series({2:'a', 1:'b', 3:'c'})

1    b
2    a
3    c
dtype: object

In [166]:
# index can be explicitly set
pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2])

3    c
2    a
dtype: object

# Pandas DataFrame Object

In [167]:
# DataFrame as generalized NumPy array

# dataframe like a 2-d array with flexible row indices and column names
# df is like a sequence of aligned Series objects in that they share the same index

area_dict = {'CA': 423967,
             'TX': 170312,
             'NY': 149995,
             'FL': 141297,
             'IL': 695662}
area = pd.Series(area_dict)

states = pd.DataFrame({'population': population,
                        'area': area})
states

      area  population
CA  423967    38332521
FL  141297    19552860
IL  695662    12882135
NY  149995    19651127
TX  170312    26448193

In [168]:
states.index

Index(['CA', 'FL', 'IL', 'NY', 'TX'], dtype='object')

In [169]:
states.columns

Index(['area', 'population'], dtype='object')

In [170]:
# DataFrame as a specialized dictionary

# dict maps a key to a value, df maps a column name to a Series of column data

states['area']

CA    423967
FL    141297
IL    695662
NY    149995
TX    170312
Name: area, dtype: int64

In [171]:
# note:
# in a NumPy array, data[0] returns the first row
# in a Pandas DF, data['col0'] would return the first column
# so better to think of a DF as a generalized dict than an array

In [172]:
# constructing DataFrame objects

In [173]:
# from a single Series object
pd.DataFrame(population, columns=['population'])

    population
CA    38332521
FL    19552860
IL    12882135
NY    19651127
TX    26448193

In [174]:
# from a list of dicts
data = [{'a': i, 'b': 2 * i}
        for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [175]:
# missing keys will be filled with NaN
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 1, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  1  4.0

In [176]:
# from a dictionary of Series objects
pd.DataFrame({'population': population,
              'area': area})

      area  population
CA  423967    38332521
FL  141297    19552860
IL  695662    12882135
NY  149995    19651127
TX  170312    26448193

In [177]:
# from a 2 dimensional NumPy array
import numpy as np
pd.DataFrame(np.random.rand(3,2),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

        foo       bar
a  0.713458  0.353500
b  0.791335  0.105003
c  0.398161  0.312212

In [178]:
# from a numpy structured array
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])
print(A)
pd.DataFrame(A)

[(0,  0.) (0,  0.) (0,  0.)]

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

# The Pandas Index Object

In [179]:
# index object can be thought of as either
# an immutable array or as an ordered set

ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [180]:
# index as immutable array
# we can use indexing notation to retrieve values/slices

print(ind[1])
print(ind[::2])

3
Int64Index([2, 5, 11], dtype='int64')

In [181]:
# index attributes
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [182]:
# index is immutable, can't be modified normally
# this will return error:
# ind[1] = 0

In [183]:
# index as ordered set

# Index object follows many conventions used by "set" data structure
# including unions, intersections, differences, and other computations

In [184]:
# intersection
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])
indA & indB

Int64Index([3, 5, 7], dtype='int64')

In [185]:
# union
indA | indB

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [186]:
# symmetric difference
indA ^ indB

Int64Index([1, 2, 9, 11], dtype='int64')

# Data Indexing and Selection

In [187]:
# Data Selection in Series

In [188]:
# Series as dictionary

In [189]:
# like dict, series provides mapping from keys to values
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
print(data)
data['b']

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

0.5

In [190]:
# we can use dictionary-like expressions
print('a' in data)
print(data.keys())
print(list(data.items()))

True
Index(['a', 'b', 'c', 'd'], dtype='object')
[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [191]:
# series can be modified with dict-like syntax
# extending series by assigning to new index value
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [192]:
# Series as a 1-dimensional array

In [193]:
# Series provides array-style item selection

In [194]:
# slicing by explicit index
data['a':'c']

# note that "c" is included when slicing by explicit index

a    0.25
b    0.50
c    0.75
dtype: float64

In [195]:
# slicing by implicit integer index
data[0:2]

# note that "c" is excluded when slicing by implicit index

a    0.25
b    0.50
dtype: float64

In [196]:
# masking
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [197]:
# fancy indexing
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

In [198]:
# Indexers: loc, iloc, and ix

# these can be confusing
# if Series has explicit integer index, data[1] will use explicit indices
# while a slicing operation like data[1:3] will use implicit Python-style index

# special attributes are provided for consistent indexing

In [199]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [200]:
# explicit index # is used when indexing
data[1]

'a'

In [201]:
# but implicit index (row #) is used when slicing
data[1:3]

3    b
5    c
dtype: object

In [202]:
# loc attribute
# allows indexing and slicing that always references the EXPLICIT index

print( data.loc[1] )
print( data.loc[1:3] )

a
1    a
3    b
dtype: object

In [203]:
# iloc attribute
# allows indexing and slicing that always references the IMPLICIT Python-style index

print( data.iloc[1] )
print( data.iloc[1:3] )

b
3    b
5    c
dtype: object

In [204]:
# ix is a hybrid of the two, will explain below

In [205]:
# in Python, "explicit is better than implicit"
# book recommends loc and iloc for clearer code and to prevent bugs

# Data Selection in DataFrame

In [206]:
# DF acts in ways like a 2d or structured array
# and in other ways like a dictionary of Series structures sharing the same index

In [207]:
# DataFrame as a Dictionary

In [208]:
area = pd.Series({'California': 423967, 'Texas': 695662,'New York': 141297, 'Florida': 170312, 'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,'New York': 19651127, 'Florida': 19552860, 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135
New York    141297  19651127
Texas       695662  26448193

In [209]:
# access a Series via dictionary-style indexing of column name:
data['area']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [210]:
# or use attribute-style access with column names (if the names are strings)
data.area

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [211]:
# both methods are the same if column name is a string
print(data.area is data['area'])
# this doesn't always work, for example, "pop" is a method of dataframe
print(data.pop is data['pop'])
# use:
# data['pop'] = z
# not:
# data.pop = z

True
False

In [212]:
# adding column using dictionary-like syntax
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

In [213]:
# DataFrame as a 2-dimensional array

In [214]:
# we can examine underlying array using the values attribute
data.values

array([[  4.23967000e+05,   3.83325210e+07,   9.04139261e+01],
       [  1.70312000e+05,   1.95528600e+07,   1.14806121e+02],
       [  1.49995000e+05,   1.28821350e+07,   8.58837628e+01],
       [  1.41297000e+05,   1.96511270e+07,   1.39076746e+02],
       [  6.95662000e+05,   2.64481930e+07,   3.80187404e+01]])

In [215]:
# we can do array-like operations...
# Transposing rows and columns
data.T

           California       Florida      Illinois      New York         Texas
area     4.239670e+05  1.703120e+05  1.499950e+05  1.412970e+05  6.956620e+05
pop      3.833252e+07  1.955286e+07  1.288214e+07  1.965113e+07  2.644819e+07
density  9.041393e+01  1.148061e+02  8.588376e+01  1.390767e+02  3.801874e+01

In [216]:
# but we can't index it like a NumPy array
# passing a single index returns a row
data.values[0]

array([  4.23967000e+05,   3.83325210e+07,   9.04139261e+01])

In [217]:
# and passing an index accesses a column
data['area']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [218]:
# so we can instead use the Pandas indexers

In [219]:
# iloc
print(data.iloc[:3, :2])

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135

In [220]:
# loc
print(data.loc[:'IL', :'pop'])

              area       pop
California  423967  38332521
Florida     170312  19552860

In [221]:
# ix allows a hybrid of loc and iloc
data.ix[:3, :'pop']

# but this is deprecated, so I guess we won' be using it...

/home/chris/miniconda3/lib/python3.6/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135

In [222]:
# we can combine masking and fancy indexing
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
Florida   19552860  114.806121
New York  19651127  139.076746

In [223]:
# we can set or modify values
data.iloc[0, 2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

In [224]:
# additional indexing conventions

In [225]:
# indexing refers to columns
# slicing refers to rows
data['Florida':'Illlinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [226]:
# slices can also refer to rows by number
data[1:3]

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [227]:
# direct masking operations are interpreted row-wise instead of column-wise
data[data.density > 100]

            area       pop     density
Florida   170312  19552860  114.806121
New York  141297  19651127  139.076746

# Operating on Data in Pandas

In [228]:
# Ufuncs: index preservation
# any NumPy ufun will work on Pandas objects
# if we apply a ufunc, the result is another Pandas object with indices preserved

In [229]:
# ufunc operation on Series
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
print(ser)
np.exp(ser)

0    6
1    3
2    7
3    4
dtype: int64

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [230]:
# ufunc operation on DataFrame
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
print(df)
np.sin(df * np.pi / 4)

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [231]:
# UFuncs: Index Alignment

In [232]:
# index alignment in Series
area = pd.Series({'Alaska': 1723337, 'Texas': 695662, 'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193, 'New York': 19651127}, name='population')

population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [233]:
# NaN added when both indeces are not present
# we can instead use a "fill value"
population.divide(area, fill_value=0)

# though this causes a divide by zerio situation for NY in this case

Alaska         0.000000
California    90.413926
New York            inf
Texas         38.018740
dtype: float64

In [234]:
# index alignment in DataFrame
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

   A   B
0  1  11
1  5   1

In [235]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('CBA'))
B

   C  B  A
0  4  0  9
1  5  8  0
2  9  2  6

In [236]:
A + B

      A     B   C
0  10.0  11.0 NaN
1   5.0   9.0 NaN
2   NaN   NaN NaN

In [237]:
# indices are aligned and sorted regardless of the order of the two objects
# we can use fill values to avoid the NaN

# in this case, we'll substute the mean (of all values in A) for any missing values in A
fill = A.stack().mean()
print(fill)
A.add(B, fill_value=fill)

4.5

      A     B     C
0  10.0  11.0   8.5
1   5.0   9.0   9.5
2  10.5   6.5  13.5

In [238]:
# Python Operator Pandas Method(s)
# +               add()
# -               sub(), subtract()
# *               mul(), multiply()
# /               truediv(), div(), divide()
# //              floordiv()
# %               mod()
# **              pow()

In [239]:
# Ufuncs: Operations Between DataFrame and Series
# similar to operations between a 2d and 1d NumPy array

In [240]:
A = rng.randint(10, size=(3,4))
A

array([[3, 8, 2, 4],
       [2, 6, 4, 8],
       [6, 1, 3, 8]])

In [241]:
# subtract first row from all rows
A - A[0]
# in NumPy broadcasting, the subtraction is applied row-wise

array([[ 0,  0,  0,  0],
       [-1, -2,  2,  4],
       [ 3, -7,  1,  4]])

In [242]:
# in Pandas, is also applied row-wise by default
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [243]:
# we can specify the axis to operate on columns instead
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -5  0 -6 -4
1 -4  0 -2  2
2  5  0  2  7

In [244]:
# like with Series, these operations will align indices
halfrow = df.iloc[0, ::2]
print(halfrow)
df - halfrow

Q    3
S    2
Name: 0, dtype: int64

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -1.0 NaN  2.0 NaN
2  3.0 NaN  1.0 NaN

# Handling Missing Data

In [245]:
# Pandas uses sentinal values None and Nan to mark missing data

In [246]:
# None: Pythonic missing data
# None is a Python object, which can only be used in arrays of data type "object"

vals1 = np.array([1, None, 3, 4])
vals1

# because this is an array of type object, any operations on the data are done at the Python level
# much more overhead, and aggregates won't work

array([1, None, 3, 4], dtype=object)

In [247]:
# NaN: Missing numerical data
# NaN, Not a Number, is a special floating-point value

vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [248]:
# the result of any operation on a nan will be another nan

1 + np.nan

nan

In [249]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [250]:
# there are aggregations that will ignore the nans
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

In [251]:
# Pandas con convert between NaN and None interchangably
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [252]:
# For types that don't have a sentinal value, Pandas type-casts when NA values are present

# example for integers (which don't have NaN)
x = pd.Series(range(2), dtype=int)
print(x)
x[0] = None
print(x)

# Pandas automatically casts integer array to floating point, and converts the None to a NaN

0    0
1    1
dtype: int64
0    NaN
1    1.0
dtype: float64

In [253]:
# Operating on Null Values

In [254]:
# detecting null values
data = pd.Series([1, np.nan, 'hello', None])
print(data)

0        1
1      NaN
2    hello
3     None
dtype: object

In [255]:
# isnull()
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [256]:
# notnull()
# used as a mask
data[data.notnull()]

0        1
2    hello
dtype: object

In [257]:
# dropna()
data.dropna()

0        1
2    hello
dtype: object

In [258]:
# for a dataframe, we can't just drop single values, only full rows or columns
# dropna() gives additional options

df = pd.DataFrame([[1, np.nan, 2],
                   [2, 3, 5],
                   [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [259]:
# by default, dropna() will dropp all rows in which any null value is present
df.dropna()

     0    1  2
1  2.0  3.0  5

In [260]:
# or drop all columns with NA values
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [261]:
# we can drop rows or columns with all NA values, or majority of NA
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [262]:
# default is how='any'
# we can specify how='all'
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [263]:
# thresh parameter specifies minimum # of NON-NULL values
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [264]:
# filling null values

data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [265]:
# fillna() replaces null values

# we can fill NA with a value such as 0
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [266]:
# use forward-fill to carry the previous value forward
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [267]:
# use back-fill to carry the next value back
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [268]:
# for dataframes, we can specify an axis along with the fills take place
df.fillna(method='ffill', axis=1)

# in this case, a previous value was not available on row 2, so the NaN remains

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

# Hierarchial Indexing (multi-indexing)

In [269]:
# we can set up a 2d array with tuples for index ('the bad way')

index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [270]:
# Pandas MultiIndex
index = pd.MultiIndex.from_tuples(index)
index

# the MultiIndex contains multiple levels of indexing:
# - state names
# - years
# and multiple labels for each data point

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [271]:
# reindex our series with the MultiIndex
# to get the hierarchial representation of the data
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [272]:
# now we can slice
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [273]:
pop['New York']

2000    18976457
2010    19378102
dtype: int64

In [274]:
# MultiIndex as extra dimension
# unstack() method converts multi-indexed series into a DataFrame
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [275]:
# stack() reverses unstack
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [276]:
# each extra level in a multi-index represents an extra dimension of data
# if we want to add another column of data for each state and year:
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

#

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [277]:
# using ufunc to get $ of people under 18 by year
f_u18 = pop_df['under18'] / pop_df['total']
f_u18

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

In [278]:
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [279]:
# Methods of MultiIndex Creation

In [280]:
# pass a list of 2 or more index arrays to the constructor
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]], # index is a tuple of lists
                  columns=['data1', 'data2'])
df

# the tuple index tells Pandas to create a multi-index for the dataframe

        data1     data2
a 1  0.120337  0.957727
  2  0.818532  0.024324
b 1  0.834676  0.599508
  2  0.700579  0.645791

In [281]:
# or pass a dictionary with tuples as keys
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [282]:
# explicit multiindex constructors
# using the class method constructors in pd.MultiIndex

In [283]:
# constructing from simple list of arrays, giving index values within each level
arr1 = ['a', 'a', 'b', 'b']
arr2 = [1, 2, 1, 2]

pd.MultiIndex.from_arrays([arr1, arr2])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [284]:
# constructing from list of tuples, giving multiple index values of each point
t1 = ('a', 1)
t2 = ('a', 2)
t3 = ('b', 1)
t4 = ('b', 2)

pd.MultiIndex.from_tuples([t1, t2, t3, t4])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [285]:
# constructing directly using internal coding by passing levels and labels
# levels: list of lists containing available index values for each level
# labels: list of lists that reference these labels
level1 = ['a', 'b']
level2 = [1, 2]
label1 = [0, 0, 1, 1]
label2 = [0, 1, 0, 1]

pd.MultiIndex(levels=[level1, level2],
              labels=[label1, label2])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [286]:
# MultiIndex level names
# levels can be named for convenience by passing the names argument
# or by setting the names attribute of the index after the fact
print(pop)
pop.index.names = ['state', 'year']
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [310]:
# MultiIndex for columns
# just as rows can have multiple levels of indices, columns can as well

years = [2013, 2014, 2015]
visits = [1, 2]
names = ['Alexsey', 'Anna', 'Chris', 'Sofia']
types = ['HR', 'Temp']

# hierarchical indices and columns
index = pd.MultiIndex.from_product([years, visits],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([names, types],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(6, 8), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject    Alexsey        Anna       Chris       Sofia
type            HR  Temp    HR  Temp    HR  Temp    HR  Temp
year visit
2013 1        35.0  36.0  36.0  37.3  31.0  37.6  24.0  37.3
     2        58.0  37.2  43.0  37.3  34.0  38.8  35.0  37.6
2014 1        32.0  38.4  41.0  37.7  23.0  37.6  30.0  37.7
     2        42.0  37.8  28.0  35.9  45.0  35.9  26.0  36.9
2015 1        37.0  35.8  40.0  35.8  15.0  37.5  17.0  36.3
     2        21.0  37.8  30.0  37.5  41.0  37.7  26.0  36.2

In [295]:
# this is basically 4-dimensional data.  Dimensions are:
# subject, measurement type, year, visit humber

# now we can index the top-level column by the person's name and get a full dataframe of that person's info
health_data['Sofia']

type          HR  Temp
year visit
2013 1      29.0  38.7
     2      57.0  35.3
2014 1      20.0  34.6
     2      29.0  37.3
2015 1      37.0  38.2
     2      37.0  36.7

In [297]:
# Indexing and Slicing a MultiIndex
# think about the indices as added dimensions

# multiple-indexed series
print(pop)
pop['California', 2000]

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

33871648

In [298]:
# partial slicing is available as long as the MultiIndex is sorted
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [299]:
# partial indexing on lower levels by passing an empty slice in the first index
# requires sorted indices
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [300]:
# selection based on boolean mask
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [301]:
# selection based on fancy indexing
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [302]:
# multiple-indexed DataFrames

health_data

subject    Chris        Anna       Sofia       Aleksey
type          HR  Temp    HR  Temp    HR  Temp      HR  Temp
year visit
2013 1      43.0  36.8  36.0  35.8  29.0  38.7    29.0  36.5
     2      35.0  36.5  29.0  39.3  57.0  35.3    26.0  38.4
2014 1      43.0  36.6  41.0  38.3  20.0  34.6    33.0  36.7
     2      18.0  37.0  49.0  36.8  29.0  37.3    34.0  36.5
2015 1      37.0  35.9  40.0  35.7  37.0  38.2    39.0  36.3
     2      29.0  38.6  40.0  38.3  37.0  36.7    45.0  37.2

In [303]:
# since columns are primary in DataFrame, syntax for multi-indexed Series applies to the columns
health_data['Chris', 'HR']

year  visit
2013  1        43.0
      2        35.0
2014  1        43.0
      2        18.0
2015  1        37.0
      2        29.0
Name: (Chris, HR), dtype: float64

In [304]:
# using iloc
health_data.iloc[:2, :2]

subject    Chris
type          HR  Temp
year visit
2013 1      43.0  36.8
     2      35.0  36.5

In [308]:
# passing a tuple of multiple indices
health_data.loc[:, ('Chris', 'Temp')]

year  visit
2013  1        36.8
      2        36.5
2014  1        36.6
      2        37.0
2015  1        35.9
      2        38.6
Name: (Chris, Temp), dtype: float64

In [313]:
# create IndexSlice object to pull slices using specific index values
# requires sorted indices
# Temp by Year
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'Temp']]

subject    Alexsey  Anna Chris Sofia
type          Temp  Temp  Temp  Temp
year visit
2013 1        36.0  37.3  37.6  37.3
2014 1        38.4  37.7  37.6  37.7
2015 1        35.8  35.8  37.5  36.3

In [317]:
# another IndexSlice, Heart Rate by visit for 2014
health_data.loc[idx[2014], idx[:, 'HR']]

subject Alexsey  Anna Chris Sofia
type         HR    HR    HR    HR
visit
1          32.0  41.0  23.0  30.0
2          42.0  28.0  45.0  26.0